tests/src/serviceTest/resources/request/consultationDroits/v3/25_droit_non_ouvert_6302_request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://ws.cegedimassurance.com/basededroit/wsdl" xmlns:base="http://norme.cegedimassurances.com/base_de_droit" xmlns:com="http://norme.cegedimassurances.com/commun" xmlns:ben="http://norme.cegedimassurances.com/beneficiaire" xmlns:amc="http://norme.cegedimassurances.com/amc">
    <soap:Header/>
    <soap:Body>
        <wsdl:getInfoBddRequest>
            <base:header_in>
                <com:headerTech>
                    <com:id_logiciel_client>LGPL1G0G0215</com:id_logiciel_client>
                    <com:version_logiciel_client>1</com:version_logiciel_client>
                    <com:id_session_client>111111111111111111111111111111111111</com:id_session_client>
                    <com:id_session_serveur>d861b19c-be66-4f05-a589-864d28272a75</com:id_session_serveur>
                </com:headerTech>
                <com:headerFonc>
                    <com:code_contexte>CD-01</com:code_contexte>
                    <com:delivrance_accreditation>1</com:delivrance_accreditation>
                    <com:code_proprietaire>511719</com:code_proprietaire>
                    <com:code_gestionnaire>00000000920001</com:code_gestionnaire>
                </com:headerFonc>
            </base:header_in>
            <base:beneficiaire>
                <ben:NIR_certifie>1861199216086</ben:NIR_certifie>
                <ben:cle_NIR>59</ben:cle_NIR>
                <ben:date_naissance>20120214</ben:date_naissance>
                <ben:rang_gemellaire>1</ben:rang_gemellaire>
            </base:beneficiaire>
            <base:amc>
                <amc:numero_AMC_prefectoral>0004400008</amc:numero_AMC_prefectoral>
            </base:amc>
            <base:info_bdd>
                <base:type_recherche_benef>0</base:type_recherche_benef>
                <base:type_recherche_segment>3</base:type_recherche_segment>
                <base:liste_segment_recherche>
                    <base:segment_recherche>PHAR</base:segment_recherche>
                    <base:segment_recherche>PHOR</base:segment_recherche>
                    <base:segment_recherche>PHCN</base:segment_recherche>
                    <base:segment_recherche>PHNO</base:segment_recherche>
                </base:liste_segment_recherche>
                <base:type_profondeur_recherche>0</base:type_profondeur_recherche>
            </base:info_bdd>
            <base:dates>
                <com:date_reference>2024-08-28</com:date_reference>
                <com:type_date_reference>1</com:type_date_reference>
            </base:dates>
        </wsdl:getInfoBddRequest>
    </soap:Body>
</soap:Envelope>
